use vk;


INSERT INTO vk.users
(firstname, lastname, email, password_hash, phone, is_deleted)
values
('Иван', 'Смирнов', 'some11@email', '12421458734', 19234744, b'0'),
('Сергей', 'Иванов', 'some20@email', '12421344', 1923412, b'0'),
('Александр', 'Иванов', 'some30@email', '1242112334', 1341234, b'0'),
('Максим', 'Иванов', 'some40@email', '12421123434', 1923441234, b'0'),
('Петр', 'Иванов', 'some50@email', '1242152634', 192341237894, b'0'),
('Данил', 'Иванов', 'some60@email', '124209134', 1923414567234, b'0'),
('Николай', 'Иванов', 'some7@0email', '124209876134', 19234, b'0'),
('Михаил', 'Иванов', 'some80@email', '12421187643234', 145741234, b'0'),
('Игнат', 'Иванов', 'some90@email', '0085561242134', 192349871234, b'0'),
('Василий', 'Иванов', 'some100@email', '12421345834', 19234234561234, b'0');


INSERT INTO vk.comments
(body, user_id, media_id, date_id)
values
('пыцукпывап', 1, 1, '2021-10-24 18:22:23'),
('цукппрь ывр ываи', 2, 2, '2021-10-25 18:22:23'),
('ыфвам цукр', 3, 3, '2021-10-26 18:22:23'),
('фыапцукр ', 4, 4, '2021-10-27 18:22:23'),
('уцкнгщдат', 5, 5, '2021-10-28 18:22:23'),
('цулрпавымаукел', 6, 6, '2021-10-10 18:22:23'),
('цукнлешлоыквк6', 7, 7, '2021-10-11 18:22:23'),
('йцущжп', 8, 8, '2021-10-12 18:22:23'),
('й34шщжлброьт им', 9, 9, '2021-10-13 18:22:23'),
('фуывюпоьрат в', 10, 10, '2021-10-14 18:22:23')
; 

INSERT INTO vk.messages
(from_user_id, to_user_id, body, created_at)
values
(1, 2, 'чясаикеи', '2021-10-10 18:22:23'),
(2, 3, 'улдорпа', '2021-10-12 18:22:23'),
(3, 4, 'увкапро', '2021-10-13 18:22:23'),
(5, 6, 'смитьб', '2021-10-14 18:22:23'),
(7, 8, 'дщшгнеа', '2021-10-15 18:22:23'),
(9, 10, 'ывакпенгшлщдбьт', '2021-10-16 18:22:23'),
(10, 110, 'цывукенгшлор', '2021-10-17 18:22:23');


select DISTINCT `firstname` from `users`;


update `users` 
SET `is_deleted` = 1 
limit 5;


delete from comments where date_id > NOW();


-- Темой для курсового проекта выбрал магазин инструментов